content-org/logs.org
#+hugo_base_dir: ../
#+hugo_section: logs


** Status update #2 :log:
   :PROPERTIES:
   :EXPORT_FILE_NAME: status-update-2
   :EXPORT_DATE: 2020-0l-31
   :EXPORT_HUGO_CUSTOM_FRONT_MATTER: aliases /log/status-update-2
   :END:

Guess it's time for a status update.

2020 huh. Well as usual I don't have a resolution this year. My
resolution deadlines are quite small and always ends with utter
disappointment, so I better not mention it here.(recruiters ignore this)

#+BEGIN_QUOTE
  Let's get serious!
#+END_QUOTE

*** *New project*
    :PROPERTIES:
    :CUSTOM_ID: new-project
    :END:

In January, I started working on a project named *Solitude*. It's a note
taking application which is using GitHub as a CMS. It will create and
maintain a repository of notes and will sync them in real-time. The
design is inspired from [[https://utteranc.es/][utteranc.es]] which uses
GitHub issues to store blog comments. This website uses Utterances too.

Solitude aims to be a very opinionated and self-controlled note taking
application. Hence the contents of the solitude-maintained repository
should only be modified by the application in order to maintain a stable
state.

I am using React, Redux and GitHub's graphQL API to build this
application. Also using [[https://codemirror.net][Codemirror]] as the
note taking editor.

The hardest part building this application is to rememeber technologies
that I haven't used in almost an year.

New project ideas 1. A micro server to authenticate GitHub 2. Minimal
static site generator

I will be using python to build both the projects.

*** *New languages*
    :PROPERTIES:
    :CUSTOM_ID: new-languages
    :END:

I have been writting Javascript and Python for the pase 4 years and I
have always believed that these two are enough to satisfy all my needs
as web developer. Then I came accross a
[[https://youtu.be/OyfBQmvr2Hc][Talk]] and I decided that I gotta learn
LISP.

Also I am thinking to switching to Emacs. Already joined their camp on
reddit.

P.S: Unedited and raw stuff
